def translator_to_shlokavica(text):
    shlokavica_alphabet = ["A", "B", "V", "G", "D", "E", "J", "Z", "I", "Y", "K", "L", "M", "N", "O", "P", "R", "S", 
    "T", "U", "F", "H", "C", "4", "6", "6T", "U", "Y", "YU", "Q"]

    normal_cyrilic_alphabet = ["А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", 
    "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ь", "Ю", "Я"]

    alphabet_kvpairs = dict(zip(normal_cyrilic_alphabet, shlokavica_alphabet))
    return ''.join([alphabet_kvpairs[symbol] if symbol in alphabet_kvpairs.keys()
        else (alphabet_kvpairs[symbol.upper()]).lower() if symbol.upper() in alphabet_kvpairs.keys() 
        else symbol for symbol in text])

print(translator_to_shlokavica("""ТОЗИ ТЕКСТ Е МНОГО ГОТИН И АЗ ЛИЧНО МНОГО ГО ХАРЕСВАМ И ОБОЖАВАМ ЪГЛОВО ЮТИИ И 
СТАРИ ЕЛЕМЕНТИ НА УРНИ ЯГОДИ ДРЕСИНГ ЖУРНАЛИСТИКА ЙОДА ШАНТАЖ ИЛИ ЩАНД---"""))

print(translator_to_shlokavica("""Така
Не знам дали си чела групата
Ама ходихме на ескейп рум
Ама такъв страшен
Обърни внимание как пише, че един човек от отбора трябва да бяга от злодея
Това бях аз
А злодеят беше един маняк със син гащеризон и маска на жабясало сбръчкано прасе
Та те са две стаи с два коридора за бягане в кръг
И в едната стая има едно въже
И тоз маняк влиза през единия коридор
Аз бягам в другата стая
И се обръщам назад и го гледам как се е хванал за въжето и е с единия крак на стената и се прави на тарзан
После слиза и продължава да ме гони
И по едно време маняка взе да става мега бърз
Смисъл това реално ми беше второто гонене и на първото не беше мн бърз
Ама тоя път аз хамаля мръсен спринт
И се обръщам и маняка е на една ръка разстояние от мен
И през цялото това време докато те гони светлините мигат като луди и гърми death metal музика
И аз като го видях се насрах
И тръгнах на мръсен спринт към другия коридор
Обаче до мен имаше един стол на който слагат 5-тия играч ако има такъв
И аз си изшибах единия крак в него и се спънах и литнах сиг 3 метра на пред и се изстърсих
И той тогава спря да ме гони
И си разбих двете колена и най-вече лакътя
Та да
Беше фън
После бях параноик до края на играта и всеки път като стане нещо стряскащо и скачах
Адекватното разказване на този виц изисква от мен жестикулация с двете ръце
Която няма как да направя докато снимам себе си
Така че не мога да ти кажа този виц"""));

